import random

def coin_game():
    print("코인 맞추기 게임에 오신 것을 환영합니다!")
    print("컴퓨터가 코인을 던졌습니다! 앞면일지 뒷면일지 맞춰보세요.")
    play=0
    win=0
    while play!=3:
        coin = random.randint(0, 1)
        print("-----------------------------------------------------------------------------------------")
        pick = input("앞면(0) 또는 뒷면(1) 중 무엇일지 추측해보세요: ")
        
        print("-----------------------------------------------------------------------------------------")
        if pick == 0 and pick == 1:
            print("잘못된 입력입니다. 0(앞면) 또는 1(뒷면)만 입력 가능합니다.")
            continue

        if pick == coin:
            print("정답입니다!")
            play += 1
            win += 1
        else:
            print("틀렸습니다.")
            play += 1
        
        print(f"현재 정답 횟수 : {win} 번")
        
    if win ==3:
        print("-----------------------------------------------------------------------------------------")
        print("게임 승리! 3회 모두 성공하여 경험치를 300 얻습니다!")
        return True
    else:
        print("-----------------------------------------------------------------------------------------")
        print(f"게임 진행 3회 중 {win}번 승리하여 경험치를 얻지 못하였습니다.")
        return False
